In [2]:
import pandas as pd
people = {
    "firstName": ["Corey", "Jane", "John", "Susan"],
    "lastName": ["Schafer", "Smith", "Doe", "Doe"],
    "email": [
        "corey_schafer@mail.com",
        "jane_smith@mail.com",
        "john_doe@mail.com",
        "susan_doe@mail.com"
    ]
}
df = pd.DataFrame(people)

In [35]:
df

                    email       fullName firstName lastName
0  corey_schafer@mail.com  Corey Schafer     Corey  Schafer
1     jane_smith@mail.com     Jane Smith      Jane    Smith
2       john_doe@mail.com       John Doe      John      Doe
3      susan_doe@mail.com      Susan Doe     Susan      Doe
4     tony_stark@mail.com            NaN      Tony    Stark
5    billy_jones@mail.com            NaN     Billy    Jones

In [6]:
# Creates a new column named fullName with the value passed to it
df["fullName"] = df["firstName"] + " " + df["lastName"]

In [10]:
# Drop the passed columns from DataFrame
df.drop(columns = ["firstName", "lastName"], inplace = True)

In [23]:
# Splits the fullName in two columns
splitedFullName = df["fullName"].str.split(" ", expand = True)
# Set the splited column to columns: firstName and lastName
df[["firstName", "lastName"]] = splitedFullName

In [25]:
df.append({ "firstName": "Tony" }, ignore_index = True)

                    email       fullName firstName lastName
0  corey_schafer@mail.com  Corey Schafer     Corey  Schafer
1     jane_smith@mail.com     Jane Smith      Jane    Smith
2       john_doe@mail.com       John Doe      John      Doe
3      susan_doe@mail.com      Susan Doe     Susan      Doe
4                     NaN            NaN      Tony      NaN

In [31]:
people2 = {
    "firstName": ["Tony", "Billy"],
    "lastName": ["Stark", "Jones"],
    "email": ["tony_stark@mail.com", "billy_jones@mail.com"]
}
df2 = pd.DataFrame(people2)

In [32]:
df2

  firstName lastName                 email
0      Tony    Stark   tony_stark@mail.com
1     Billy    Jones  billy_jones@mail.com

In [33]:
# Appends the new DataFrame to the old one
df.append(df2, ignore_index = True)

                    email       fullName firstName lastName
0  corey_schafer@mail.com  Corey Schafer     Corey  Schafer
1     jane_smith@mail.com     Jane Smith      Jane    Smith
2       john_doe@mail.com       John Doe      John      Doe
3      susan_doe@mail.com      Susan Doe     Susan      Doe
4     tony_stark@mail.com            NaN      Tony    Stark
5    billy_jones@mail.com            NaN     Billy    Jones

In [34]:
# Set the combined data frames to df
df = df.append(df2, ignore_index = True)

In [41]:
filter_doe = df["lastName"] == "Doe"
doe_index = df[filter_doe].index
df.drop(index = doe_index)

                    email       fullName firstName lastName
0  corey_schafer@mail.com  Corey Schafer     Corey  Schafer
1     jane_smith@mail.com     Jane Smith      Jane    Smith
4     tony_stark@mail.com            NaN      Tony    Stark
5    billy_jones@mail.com            NaN     Billy    Jones